Repository: luojunyuan/TouchChanX
Catalog: TouchChanX.Package/Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp, zh_cn

# Description
source: A visual novel tool for win-tablet
ja_jp: タブレットためのエロゲツール
zh_cn: 平板设备的美少女游戏工具

# DisplayName
source: TachiChan
ja_jp: タッチちゃん
zh_cn: 触控酱

# Confirm
source: OK
zh_cn: 确定

source: Cancel
ja_jp: キャンセル
zh_cn: 取消

source: Save
ja_jp: 保存
zh_cn: 保存

source: Close
ja_jp: 閉じる
zh_cn: 关闭

source: Browse…
ja_jp: 参照…
zh_cn: 浏览…

source: Copy
ja_jp: コピー
zh_cn: 复制

source: Done
ja_jp: 完了
zh_cn: 完成

source: On
ja_jp: オン
zh_cn: 开启

source: Off
ja_jp: オフ
zh_cn: 关闭

# MainNavHome
source: Home
ja_jp: ホーム
zh_cn: 主页

# MainNavSettings
source: Settings
ja_jp: 設定
zh_cn: 设置

# MainNavAbout
source: About
ja_jp: 概要
zh_cn: 关于

# HomeTitle
source: Launch Game
ja_jp: ゲーム起動
zh_cn: 游戏启动

# HomeDescription
source: Select or drag in a game executable; TouchChanX will launch it through the touchchanx protocol.
ja_jp: ゲームのメインプログラムを選択またはドラッグすると、TouchChanX が touchchanx プロトコルで起動します。
zh_cn: 选择或拖入游戏主程序，TouchChanX 会通过 touchchanx 协议启动。

# HomeAddGame
source: Add Game
ja_jp: ゲームを追加
zh_cn: 添加游戏

# HomeDropHint
source: Drop an .exe or .lnk to add a game
ja_jp: .exe または .lnk をドロップしてゲームを追加
zh_cn: 拖入 .exe 或 .lnk 添加游戏

# HomeListHint
source: Added games will appear in a vertical list.
ja_jp: 追加したゲームは縦方向のリストに表示されます。
zh_cn: 添加后会显示为竖向游戏列表。

# HomeLaunch
source: Launch
ja_jp: 起動
zh_cn: 启动

# HomeRename
source: Rename
ja_jp: 名前を変更
zh_cn: 重命名

# HomeRemove
source: Remove
ja_jp: 削除
zh_cn: 移除

# HomeLaunchFailedTitle
source: Launch failed
ja_jp: 起動に失敗しました
zh_cn: 启动失败

# ProtocolLaunchFailed
source: Unable to call the touchchanx protocol.
ja_jp: touchchanx プロトコルを呼び出せません。
zh_cn: 无法调用 touchchanx 协议。

# HomeDisplayNameHeader
source: Display name
ja_jp: 表示名
zh_cn: 显示名称

# HomeRenameTitle
source: Rename game
ja_jp: ゲーム名を変更
zh_cn: 重命名游戏

# HomeDragCaption
source: Add to TouchChanX
ja_jp: TouchChanX に追加
zh_cn: 添加到 TouchChanX

# AboutBuildLabel
source: Build dev 2026.7
ja_jp: ビルド dev 2026.7
zh_cn: 构建 dev 2026.7

# AboutTouchMenuHint
source: Tap the game window to open the Touch menu.
ja_jp: ゲームウィンドウをタップすると Touch メニューを開けます。
zh_cn: 轻触游戏窗口的 Touch 菜单。

# AboutRateHeader
source: Rate TouchChanX
ja_jp: TouchChanX を評価
zh_cn: 为 TouchChanX 评分

# AboutRateDescription
source: Open the Microsoft Store rating entry.
ja_jp: Microsoft Store の評価ページを開きます。
zh_cn: 打开 Microsoft Store 评分入口。

# AboutOpenSourceHeader
source: Open-source project
ja_jp: オープンソースプロジェクト
zh_cn: 开源项目

# AboutOpenSourceDescription
source: View the source code, license, and issues.
ja_jp: ソースコード、ライセンス、issue を確認します。
zh_cn: 查看源码、许可和 issue。

# AboutQqHeader
source: QQ group
ja_jp: QQ グループ
zh_cn: QQ 交流群

# AboutQqDescription
source: Share feedback and ideas with the developer and discuss new features.
ja_jp: 開発者へのフィードバックやアイデアの共有、新機能の議論に参加できます。
zh_cn: 第一时间向开发者吐槽问题、分享想法，围观讨论新功能。

# AboutLicenseNotice
source: TouchChanX is an open-source project distributed under the license in the repository.
ja_jp: TouchChanX はオープンソースプロジェクトで、リポジトリのライセンスに従います。
zh_cn: TouchChanX 是开源项目，遵循仓库中的开源许可。

# SettingsTitle
source: Settings
ja_jp: 設定
zh_cn: 设置

# SettingsExternalLauncherHeader
source: Launch games with another program
ja_jp: 別のプログラムでゲームを起動
zh_cn: 使用其他程序启动游戏

# SettingsExternalLauncherDescription
source: Available after the launcher and its arguments are valid.
ja_jp: 起動プログラムと引数が有効な場合のみ有効にできます。
zh_cn: 启动程序和参数有效后才能启用

# LauncherPathHeader
source: Launcher program
ja_jp: 起動プログラム
zh_cn: 启动程序

# LauncherPathPlaceholder
source: Select a launcher program
ja_jp: 起動プログラムを選択してください
zh_cn: 请选择启动程序

# LauncherArgumentsHeader
source: Launch arguments
ja_jp: 起動引数
zh_cn: 启动参数

source: Insert game path
ja_jp: ゲームパスを挿入
zh_cn: 插入游戏路径

# CommandPreviewHeader
source: Command to execute
ja_jp: 実行されるコマンド
zh_cn: 实际执行的命令

source: Test launch…
ja_jp: 起動をテスト…
zh_cn: 测试启动…

# SettingsPlaceholderShellMenuHeader
source: Show TouchChanX in the context menu
ja_jp: コンテキストメニューに TouchChanX を表示
zh_cn: 在上下文菜单中显示 TouchChanX

# SettingsPlaceholderShellMenuDescription
source: Placeholder UI; not connected to ShellMenuHandler business logic yet.
ja_jp: プレースホルダー UI。ShellMenuHandler のロジックにはまだ接続されていません。
zh_cn: 仅占位 UI，暂未连接 ShellMenuHandler 业务逻辑。

# SettingsPlaceholderEdgeHeader
source: Prevent accidental touches at the top edge
ja_jp: 上端の誤操作防止
zh_cn: 顶部边缘防误触

# SettingsPlaceholderEdgeDescription
source: Placeholder UI; a small touch buffer is planned at the top of the game window.
ja_jp: プレースホルダー UI。ゲーム画面の上部に数ピクセルのタッチ余白を設ける予定です。
zh_cn: 仅占位 UI，计划在游戏画面顶部保留数像素触摸缓冲区。

# SettingsAutoSaveMessage
source: Settings are saved automatically; test the current launch configuration before enabling it for real.
ja_jp: 設定は自動保存されます。正式に有効化する前に、現在の起動設定をテストできます。
zh_cn: 设置会自动保存；正式启用前可以先测试当前启动配置。

# LauncherPathInvalid
source: The launcher program is invalid. Select an existing .exe file.
ja_jp: 起動プログラムが無効です。存在する .exe ファイルを選択してください。
zh_cn: 启动程序无效，请选择存在的 .exe 文件。

# LauncherArgumentsHint
source: {GamePath} is replaced with the full path to the game executable.
ja_jp: {GamePath} はゲーム本体の完全なパスに置き換えられます。
zh_cn: {GamePath} 会替换为游戏主程序的完整路径。

# LauncherArgumentsInvalid
source: The launch arguments are invalid. They must contain an unquoted {GamePath}.
ja_jp: 起動引数が無効です。引用符で囲まれていない {GamePath} を含めてください。
zh_cn: 启动参数无效，必须包含未加引号的 {GamePath}。

# TestLauncherTitle
source: Test launcher
ja_jp: テストランチャー
zh_cn: 测试启动器

# ExternalDialogStartTest
source: Start test
ja_jp: テスト起動
zh_cn: 启动测试

# ExternalDialogExistingGames
source: Games on the home page
ja_jp: ホームにあるゲーム
zh_cn: 主页已有游戏

# ExternalDialogSelectOther
source: Select another game…
ja_jp: 別のゲームを選択…
zh_cn: 选择其他游戏…

# ExternalDialogPathHeader
source: Test game path
ja_jp: テストするゲームのパス
zh_cn: 测试游戏路径

# ExternalDialogPathPlaceholder
source: Select the game executable
ja_jp: ゲーム本体を選択してください
zh_cn: 请选择游戏主程序

# ExternalDialogWarning
source: The test will actually launch the game.
ja_jp: テストでは実際にゲームを起動します。
zh_cn: 测试会实际启动游戏。

# MenuDevice
source: Device
ja_jp: デバイス
zh_cn: 设备

# MenuGame
source: Game
ja_jp: ゲーム
zh_cn: 游戏

# MenuFunction
source: Function
ja_jp: 機能
zh_cn: 功能

# MenuVolumeDown
source: Volume down
ja_jp: 音量を下げる
zh_cn: 音量减小

# MenuVolumeUp
source: Volume up
ja_jp: 音量を上げる
zh_cn: 音量增大

# MenuScreenshot
source: Screenshot
ja_jp: スクリーンショット
zh_cn: 截图

# MenuTaskView
source: Task view
ja_jp: タスクビュー
zh_cn: 任务视图

# MenuActionCenter
source: Action center
ja_jp: アクションセンター
zh_cn: 操作中心

# MenuTouchpad
source: Touchpad
ja_jp: タッチパッド
zh_cn: 触摸板

# MenuDesktop
source: Desktop
ja_jp: デスクトップ
zh_cn: 桌面

# MenuFullscreen
source: Fullscreen
ja_jp: 全画面
zh_cn: 全屏

# MenuMove
source: Move
ja_jp: 移動
zh_cn: 移动

# MenuStretch
source: Stretch
ja_jp: 引き伸ばす
zh_cn: 拉伸

# MenuClose
source: Close
ja_jp: 閉じる
zh_cn: 关闭

# MenuDim
source: Dim
ja_jp: 暗くする
zh_cn: 调暗

# MenuRestore
source: Restore
ja_jp: 元に戻す
zh_cn: 恢复

# MenuLock
source: Lock
ja_jp: ロック
zh_cn: 锁定

# MenuKeyboard
source: Keyboard
ja_jp: キーボード
zh_cn: 键盘

# MenuTapClick
source: Tap click
ja_jp: タップでクリック
zh_cn: 轻触点击

# MenuTapClickTooltip
source: When you tap, the previous tapped position will be clicked.
ja_jp: タップすると、前回タップした位置をクリックします。
zh_cn: 轻触时会点击上一次轻触的位置。

# MenuBattery
source: Battery
ja_jp: バッテリー
zh_cn: 电池

# MenuTextMagnifier
source: Text magnifier
ja_jp: 文字拡大鏡
zh_cn: 文字放大镜

# MenuGesture
source: Gesture
ja_jp: ジェスチャー
zh_cn: 手势

# MenuGamepad
source: Gamepad
ja_jp: ゲームパッド
zh_cn: 手柄

# LockWindowTitle
source: TouchChanX lock
ja_jp: TouchChanX ロック
zh_cn: TouchChanX 锁定

source: Freeze
ja_jp: フリーズ
zh_cn: 冻结

source: Unlock
ja_jp: 解除
zh_cn: 解锁

# GamepadMappingTitle
source: Gamepad mapping
ja_jp: ゲームパッドの割り当て
zh_cn: 手柄映射

# GamepadButtonHeader
source: Button
ja_jp: ボタン
zh_cn: 按键

# GamepadKeyboardKeyHeader
source: Keyboard key
ja_jp: キーボードキー
zh_cn: 键盘按键

# GamepadDPadLeft
source: D-pad Left
ja_jp: Dパッド 左
zh_cn: 方向键 左

# GamepadDPadUp
source: D-pad Up
ja_jp: Dパッド 上
zh_cn: 方向键 上

# GamepadDPadRight
source: D-pad Right
ja_jp: Dパッド 右
zh_cn: 方向键 右

# GamepadDPadDown
source: D-pad Down
ja_jp: Dパッド 下
zh_cn: 方向键 下

# GamepadStart
source: Start
ja_jp: スタート
zh_cn: 开始

# GamepadBack
source: Back
ja_jp: 戻る
zh_cn: 返回

# GamepadLeftStick
source: Left stick
ja_jp: 左スティック
zh_cn: 左摇杆

# GamepadRightStick
source: Right stick
ja_jp: 右スティック
zh_cn: 右摇杆

# GamepadKeyLeft
source: Left
ja_jp: 左
zh_cn: 左

# GamepadKeyUp
source: Up
ja_jp: 上
zh_cn: 上

# GamepadKeyRight
source: Right
ja_jp: 右
zh_cn: 右

# GamepadKeyDown
source: Down
ja_jp: 下
zh_cn: 下

# GamepadKeyEnter
source: Enter
zh_cn: 回车

# GamepadKeySpace
source: Space
zh_cn: 空格

# GamepadKeyShowMapping
source: Show mapping
ja_jp: 割り当てを表示
zh_cn: 显示映射

# GamepadClose
source: Close
ja_jp: 閉じる
zh_cn: 关闭

# BatteryOnBattery
source: On battery
ja_jp: バッテリー使用中
zh_cn: 使用电池

# BatteryCharging
source: Charging
ja_jp: 充電中
zh_cn: 充电中

# BatteryRecovering
source: Recovering
ja_jp: 回復中
zh_cn: 恢复中

# BatteryTimeLeft
source: Time left
ja_jp: 残り時間
zh_cn: 剩余时间

# BatteryPowerDraw
source: Power draw
ja_jp: 消費電力
zh_cn: 功耗

# BatteryCapacity
source: Capacity
ja_jp: 容量
zh_cn: 容量

# BatteryTimeHoursFormat
source: {0}h {1}m
ja_jp: {0}時間 {1}分
zh_cn: {0}小时{1}分钟

# BatteryTimeMinutesFormat
source: {0}m
ja_jp: {0}分
zh_cn: {0}分钟

# BatteryPowerDrawFormat
source: {0:0.0} W ({1}s)
ja_jp: {0:0.0} W（{1}秒）
zh_cn: {0:0.0} W（{1}秒）

source: Mouse click
ja_jp: マウスクリック
zh_cn: 鼠标点击

# GestureSpace
source: Space
ja_jp: スペース
zh_cn: 空格

# GestureRightClick
source: Right-click
ja_jp: マウス右クリック
zh_cn: 鼠标右键

# GestureScrollUp
source: Scroll up
ja_jp: ホイール上
zh_cn: 滚轮上划

# GestureScrollDown
source: Scroll down
ja_jp: ホイール下
zh_cn: 滚轮下滑

# SandboxSendMessage
source: Send message
ja_jp: メッセージを送信
zh_cn: 发送消息

# SandboxGamepadMapping
source: Gamepad mapping
ja_jp: ゲームパッド割り当て
zh_cn: 手柄映射

# UnknownDpiTitle
source: TouchChanX cannot determine the game's DPI scaling
ja_jp: タッチちゃんがゲームの DPI スケールを確認できません
zh_cn: 触控酱无法确定当前游戏的 DPI 缩放

# UnknownDpiContent
source: Consider restarting the game from TouchChanX
ja_jp: タッチちゃんからゲームを再起動することを検討してください
zh_cn: 请考虑从触控酱重新启动游戏

# ErrorGamePathRequired
source: No game path was provided.
ja_jp: ゲームパスが指定されていません。
zh_cn: 未提供游戏路径。

# ErrorInvalidGamePath
source: Game path "{0}" not found, please check if it exists.
ja_jp: ゲームパス「{0}」が見つかりません。存在を確認してください。
zh_cn: 游戏路径“{0}”不存在，请检查路径是否正确。

# ErrorShortcutResolve
source: Failed to resolve "{0}", please try starting from the game folder.
ja_jp: 「{0}」の解決に失敗しました。ゲームフォルダーから起動してください。
zh_cn: 解析“{0}”失败，请尝试从游戏文件夹启动。

# ErrorResolvedLinkPath
source: Resolved link path "{0}" not found, please try starting from the game folder.
ja_jp: リンク先「{0}」が見つかりません。ゲームフォルダーから起動してください。
zh_cn: 链接目标“{0}”不存在，请尝试从游戏文件夹启动。

# ErrorExternalLauncherNotFound
source: External launcher "{0}" not found, please check the launcher setting.
ja_jp: 外部ランチャー「{0}」が見つかりません。ランチャーの設定を確認してください。
zh_cn: 外部启动程序“{0}”不存在，请检查启动程序设置。

# ErrorExternalLauncherInvalid
source: Invalid external launcher configuration.
ja_jp: 外部ランチャーの設定が無効です。
zh_cn: 外部启动程序配置无效。

# ErrorExternalLauncherStart
source: Failed to start "{0}".
ja_jp: 「{0}」の起動に失敗しました。
zh_cn: 无法启动“{0}”。

# ErrorExternalLauncherStartDetails
source: Failed to start "{0}": {1}
ja_jp: 「{0}」の起動に失敗しました: {1}
zh_cn: 无法启动“{0}”：{1}

# ErrorGameStartTimeout
source: Failed to start the game within the timeout period.
ja_jp: 制限時間内にゲームを起動できませんでした。
zh_cn: 在超时时间内无法启动游戏。

# ErrorWindowNotFound
source: Timeout! Failed to find a valid game window.
ja_jp: タイムアウトしました。ゲームの有効なウィンドウが見つかりません。
zh_cn: 超时：找不到有效的游戏窗口。

# ErrorUnableToLockGame
source: Unable to lock the game.
ja_jp: ゲームをロックできません。
zh_cn: 无法锁定游戏。

# ErrorUnableToFreezeGame
source: Unable to freeze the game.
ja_jp: ゲームを一時停止できません。
zh_cn: 无法冻结游戏。
